<!-- placeholder-1 -->
```fish
terraform plan -chdir=./ -var-file=./vars.tfvars
```
<!-- placeholder-2 -->

<details><summary>Diff of 2 changes.</summary>

```diff
+ module.kube-hetzner.local_file.kustomization_backup[0] will be created
! module.kube-hetzner.null_resource.configure_autoscaler[0] is tainted, so must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 2 to add, 0 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @tonitert at 2025-09-05T16:25:18Z [(view log)](https://github.com/tonitert/ad-infra-k3s/actions/runs/17498826219/job/49706483251#step:7:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.kube-hetzner.local_file.kustomization_backup[0] will be created
  + resource "local_file" "kustomization_backup" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "k3s_kustomization_backup.yaml"
      + id                   = (known after apply)
    }

  # module.kube-hetzner.null_resource.configure_autoscaler[0] is tainted, so must be replaced
-/+ resource "null_resource" "configure_autoscaler" {
      ~ id       = "8866618178411378766" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-14-d4f15006c8c98d4f78a2c306b3d58885.tfplan -->
<!-- placeholder-6 -->